# FabricationService Properties

---
The FabricationService type exposes the following members.
| Name| Description
---|---|---
| Abbreviation|  The short name of service.
| FabricationSystemName|  The fabrication system name of the service.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  The name of the service.
| PaletteCount|  The number of palettes in the service.
| ServiceId|  The service identifier of the service.
Top
#### Reference
FabricationService Class
Autodesk.Revit.DB Namespace